lvx/base/Catalogs/бит_мпд_НастройкиВнешнихПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_мпд_НастройкиВнешнихПодключений</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеБазы</Name>
					<Comment>Серверная/Файловая</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_мпд_ВидыРасположенияИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Comment>Имя сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Comment>Имя базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Comment>Путь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/CommonModules/бит_ПолучениеДанныхСерверПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс
	
// Функция.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ИзвлечьДанныеПоляHTTP(ТекстЗапросаПоле, НастройкаПодключения) Экспорт
	
	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;	
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапросаПоле);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрОтвет);
	
	РезДанные = Новый Массив;
	ТекЭл = Неопределено;
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И Чтение.Имя = "m:properties" Тогда
			
			ТекЭлемент = Новый Структура;
			
		КонецЕсли; 
		
		Если НЕ ТекЭлемент = Неопределено Тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
				И Найти(Чтение.Имя, "d:")>0 Тогда
				
				ИмяПоля = СтрЗаменить(Чтение.Имя, "d:","");
				Если ВРег(ИмяПоля) = ВРег("Ref_Key") Тогда
					
					ИмяПоля = "ИД";	
					
				КонецЕсли; 
				флУстановитьЗначение = Истина;
				
			КонецЕсли; 
			
			Если Чтение.ТипУзла = ТипУзлаXML.Текст 
				И флУстановитьЗначение 
				И ЗначениеЗаполнено(ИмяПоля)  Тогда
				
				ТекЭлемент.Вставить(ИмяПоля, Чтение.Значение);
				флУстановитьЗначение = Ложь;
				
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента 
				И Чтение.Имя = "m:properties" Тогда
				
				РезДанные.Добавить(ТекЭлемент);
				ТекЭлемент = Неопределено;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;  // Чтение XML
	
	Возврат РезДанные;
	
КонецФункции // ИзвлечьДанныеПоляHTTP()

// Функция.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ИзвлечьДанныеИсточникаHTTP(ТекстЗапроса, НастройкаПодключения) Экспорт

	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;		
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапроса);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();

	Возврат СтрОтвет;
	
КонецФункции // ИзвлечьДанныеИсточникаHTTP()

// Функция выполняет подключение к внешней базе посредством OLE.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
// 
// Возвращаемое значение:
//  Коннектор - ComObject.
// 
Функция ПодключитьОЛЕ(НастройкаПодключения) Экспорт

	Коннектор = Неопределено;
	Коннектор = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьОЛЕ(НастройкаПодключения);
	Возврат Коннектор;
	
КонецФункции

// Функция выполняет подключение к внешней базе посредством ComConnector.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
// 
// Возвращаемое значение:
//  Коннектор - ComObject.
// 
Функция ПодключитьКОМ(НастройкаПодключения) Экспорт
            	
	Коннектор = Неопределено;
	Коннектор = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьКОМ(НастройкаПодключения);
	Возврат Коннектор;
	
КонецФункции

// См. бит_ПолучениеДанных.ПолучитьМетаданныеHTTP()
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_мпд_НастройкиВнешнихПодключений.
// 
// Возвращаемое значение:
//  HTTPОтвет.
// 
Функция ПолучитьМетаданныеHTTP(НастройкаПодключения) Экспорт
	
	ПараметрыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодключения,
							"Наименование, ИмяСервера, ИмяБазы, Пользователь, Пароль");
	ТекстЗапросаМета     = СтрШаблон("%1$metadata", бит_ПолучениеДанных.ПризнакОбращенияОДата());
	Путь                 = СтрШаблон("%1/%2", НастройкаПодключения.ИмяСервера, НастройкаПодключения.ИмяБазы);
	СоединениеHTTP       = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	ЗапросHTTP           = Новый HTTPЗапрос(ТекстЗапросаМета);
	ОтветHTTP            = СоединениеHTTP.Получить(ЗапросHTTP);
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстСообщения = НСтр("ru='Не удалось получить метаданные по настройке ""%1"". 
								  |Код ошибки: %2.
								  |Подробности см. на: http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html';
		      				  |en='Failed to get metadata for setting ""%1"". 
								  |Error code: %2.
								  |For details, see: http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, НастройкаПодключения, ОтветHTTP.КодСостояния);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
	Возврат ОтветHTTP;
	
КонецФункции

#КонецОбласти
